DataProcessors/ФормаСозданияОбращенияКлиента1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ФормаСозданияОбращенияКлиента1</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОжидании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Приоритет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Приоритет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Низкий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Высокий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Критический</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОбращенияВПоддержку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОбращенияВПоддержку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РегистрНакопления</xr:Item>
				<xr:Item>InformationRegister.ИсторияИзмененийОбращений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПоступления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРеакцииФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРешенияФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тональность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоНазначениеОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РешитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРеакцииРегламент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРешенияРегламент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияСообщений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВремя</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ФормаСозданияОбращенияКлиента1/Forms/ФормаСозданияОбращения/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ФИОКлиента = Параметры.ФИО;
КонецПроцедуры

//&НаКлиенте
//Процедура Отменить(Команда) 
//	Закрыть();	
//КонецПроцедуры

//&НаКлиенте
//Процедура СохранитьИОтправить(Команда)   
//	
//    // Проверка обязательных полей
//    Если ПустаяСтрока(Объект.Тема) Или ПустаяСтрока(Объект.Описание) Тогда
//        Сообщить("Тема и вопрос обращения обязательны для заполнения.");
//        Возврат; // Прерываем отправку
//	КонецЕсли;
//	
//    Успешно = СохранитьОбращениеНаСервере();

//	Если Успешно Тогда 
//		
//		//Сообщить("Обращение успешно отправлено!", СтатусСообщения.Важное);   

//        Закрыть(); 
//	//Иначе
//	//    Сообщить("Не удалось отправить обращение. Попробуйте позже.", СтатусСообщения.Важное);
//    КонецЕсли;
//	//Если Успешно Тогда
//	//	
//	//    Закрыть(); 
//	//КонецЕсли;
//    
//КонецПроцедуры




&НаКлиенте
Процедура СохранитьИОтправить(Команда)   

    //  Проверка обязательных полей
    Если ПустаяСтрока(Объект.Тема) Или ПустаяСтрока(Объект.Описание) Тогда
        Сообщить("Тема и описание обращения обязательны для заполнения.");
        // Не отправляем, не закрываем
        Возврат;
    КонецЕсли;

    Успешно = СохранитьОбращениеНаСервере();

    Если Успешно Тогда 
        // Передаём Истина в основную форму
        ЭтаФорма.Закрыть(Истина);
    Иначе
        Сообщить("Не удалось отправить обращение. Попробуйте позже.");
        // Закрываем без успеха
        ЭтаФорма.Закрыть(Успешно);
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда) 
    // Закрываем без результата
    Закрыть(Неопределено);	
КонецПроцедуры










&НаСервере
Функция СохранитьОбращениеНаСервере()
    
    // Создаем новый документ обращения   
    НовоеОбращение = Документы.ОбращенияВПоддержку.СоздатьДокумент();
    
    // Заполняем реквизиты документа
    НовоеОбращение.Тема = Объект.Тема;
    НовоеОбращение.Описание = Объект.Описание; 

    НовоеОбращение.КаналПоступления = Справочники.КаналыПоступления.НайтиПоНаименованию("Форма 1С"); 
    НовоеОбращение.Статус = Перечисления.СтатусыЗаявок.Новое;
	НовоеОбращение.Дата = ТекущаяДата();
	НовоеОбращение.ДатаСоздания = ТекущаяДата();
	НовоеОбращение.АвтоНазначениеОтветственного = Истина;
	//НовоеОбращение.ДатаСоздания = Дата('2025.11.26 10:45:25');
	//НовоеОбращение.Дата = Дата('2025.11.26 10:45:25');

	НовоеОбращение.Клиент = Объект.ФИОКлиента; 
	НовоеОбращение.Категория = Объект.Категория;
	НовоеОбращение.Приоритет = Объект.Приоритет;
	
	
	
	
	
	Json = Новый Структура;
	//Json.Вставить("title", "Медленная работа после обновления");
	//Json.Вставить("text", "1с "); 
	Json.Вставить("title", Объект.Тема);
	Json.Вставить("text", Объект.Описание);

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Json);
	Json = Запись.Закрыть();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	Аутентификация = Новый Структура();
	Аутентификация.Вставить("Тип", "Bearer");
	//Аутентификация.Вставить("Токен", "06b1012380f980d6f3627c1b9375658e9385d39c5311b4fef312943409d999bd");
	Аутентификация.Вставить("Токен", Константы.Токен.Получить());	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("Заголовки", Заголовки);
	ПараметрыЗапроса.Вставить("Аутентификация", Аутентификация);
	
	Ответ = КоннекторHTTP.Post(Константы.Сервер.Получить(), Json, ПараметрыЗапроса);
	Текстом = КоннекторHTTP.КакТекст(Ответ, "utf-8"); 
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Текстом);
	
	ОтветJSON = ПрочитатьJSON(Чтение);
		
	Данные = ОтветJSON.data; 
	КатегорияAI = Данные.category;
	ПриоритетAI = Данные.priority;
	
	Если НЕ ПустаяСтрока(КатегорияAI) Тогда
		
		КатегорияAI_Форматированная = ВРег(Лев(КатегорияAI, 1)) + НРег(Сред(КатегорияAI, 2));
			
		// Поиск по наименованию
		НайденнаяКатегория = Справочники.КатегорииОбращений.НайтиПоНаименованию(КатегорияAI_Форматированная);
		
		Если НЕ НайденнаяКатегория.Пустая() Тогда
			НовоеОбращение.Категория = НайденнаяКатегория;
		Иначе
			НовоеОбращение.Категория = "";
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПриоритетAI) Тогда 
		
		 ПриоритетAI_Форматированный = ВРег(Лев(ПриоритетAI, 1)) + НРег(Сред(ПриоритетAI, 2));   
		 
		Если ПриоритетAI_Форматированный = "Низкий" Тогда
			НайденныйПриоритет = Перечисления.Приоритет.Низкий; 
			
		ИначеЕсли ПриоритетAI_Форматированный = "Средний" Тогда
			НайденныйПриоритет = Перечисления.Приоритет.Средний;  
			
		ИначеЕсли ПриоритетAI_Форматированный = "Высокий" Тогда
			НайденныйПриоритет = Перечисления.Приоритет.Высокий;  
			
		Иначе
			НайденныйПриоритет = Неопределено;
		КонецЕсли;
		
		НовоеОбращение.Приоритет = НайденныйПриоритет;
	
	
	КонецЕсли;	
	
	
    // Добавляем первое сообщение в историю
    Если Не ПустаяСтрока(Объект.Описание) Тогда         
        НоваяСтрокаИстории = НовоеОбращение.ИсторияСообщений.Добавить();
        НоваяСтрокаИстории.ДатаВремя = ТекущаяДата();
        НоваяСтрокаИстории.Автор = "Клиент";
        НоваяСтрокаИстории.Текст = Объект.Описание;
    КонецЕсли;
    
    // Записываем документ
    Попытка
        НовоеОбращение.Записать();
		
        Возврат Истина;
    Исключение
        Сообщить("Ошибка при сохранении обращения: " + ОписаниеОшибки(), СтатусСообщения.Важное);
        Возврат Ложь;
    КонецПопытки;
    
КонецФункции
